9/data/attachments/32ad3ebdb4c8291e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_57c0ffc4-d148-40b0-9854-4359852bcd50</nif:username>
            <nif:friendToBeAdded>Valerie_Mrs_Friend_83373_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>